// Package option
// @Author: yinwei
// @File: cron_op
// @Version: 1.0.0
// @Date: 2024/8/2 09:15

package cron

import "github.com/robfig/cron/v3"

type CronJob struct {
	Name  string `json:"name"`
	DoJob func() `json:"-"`
	// cron 定时表达式
	// Cron表达式是一种字符串格式，用于配置定时任务的执行时间。Cron表达式由六个或七个字段组成，每个字段用空格分隔。标准的六字段表达式格式如下：
	//
	// 秒 分 时 日 月 周 [年]
	//
	// 每个字段的含义和取值范围如下：
	// 	1. 秒（Seconds）：取值范围是0-59
	// 	2. 分（Minutes）：取值范围是0-59
	// 	3. 时（Hours）：取值范围是0-23
	// 	4. 日（Day of month）：取值范围是1-31
	// 	5. 月（Month）：取值范围是1-12或JAN-DEC
	// 	6. 周几（Day of week）：取值范围是1-7或SUN-SAT，其中1表示周日
	// 	7. 年（Year）（可选）：取值范围是1970-2099
	//
	// 特殊字符
	// 	- `*` 表示所有可能的值。例如，`*` 在秒字段中表示每秒都触发。
	// 	- `?` 仅用于“日”和“周几”字段，表示不指定值（与 `*` 类似，但用于避免冲突）。
	// 	- `-` 表示范围。例如，`10-12` 在小时字段中表示10点、11点、12点。
	// 	- `,` 表示列表值。例如，`MON,WED,FRI` 在周几字段中表示星期一、三、五。
	// 	- `/` 表示步长。`0/15` 在秒字段中表示每15秒（0、15、30、45）。
	// 	- `L` 表示“最后”，可以在“日”和“周几”字段中使用。例如，`L` 在日字段中表示月的最后一天。
	// 	- `W` 表示最近的工作日。例如，`15W` 表示最近15号的工作日。
	// 	- `#` 表示每月第几个周几。例如，`2#1` 表示每月的第一个星期二。
	//
	// 示例
	// 	1. 每秒触发一次：`0/1 * * * * ?`
	// 	2. 每分钟的第15秒触发：`15 * * * * ?`
	// 	3. 每天的下午2点触发：`0 0 14 * * ?`
	// 	4. 每个月的最后一天晚上11点触发：`0 0 23 L * ?`
	// 	5. 每个工作日的早上8点触发：`0 0 8 ? * MON-FRI`
	// 	6. 每个月的第三个星期五上午10点触发：`0 0 10 ? * 6#3`
	//
	CronSpc string
	//任务未完成是否可以执行下次定时任务 true=可以 false=不可以
	DoBeforeDone bool `json:"do_before_done"`
	// 任务未完成时延迟直到当前任务完成才执行下次任务，还是跳过下次任务
	// 只有在DoBeforeDone 为false才生效
	DelayBeforeDone bool `json:"delay_before_done"`

	EntryId cron.EntryID
}
